archive/before-2018-11-10/source/2018-05-30-org-mode-to-pdf.org
#+AUTHOR: Peng Xie
#+EMAIL: pengpengxpplay@gmail.com
#+SETUPFILE: theme.setup
#+OPTIONS: ^:{}
#+TITLE:  org-mode写文档

#+LATEX_HEADER: \makeatletter \def\@maketitle{\null \begin{center} {\vskip 5em \Huge \@title} \vskip 30em {\LARGE \@author} \vskip 3em {\LARGE \@date} \end{center} \newpage} \makeatother

* 介绍
  I really do not like Microsoft Word！

** [[https://orgmode.org/][Org Mode]]
   一个快速高效的纯文本系统。我所有笔记，TODO，当前的blog以及研究生毕业
   论文全都是用它写的。

   优点：
   1. 纯文本。
   2. 开源。
   3. 高效。

** [[https://www.latex-project.org/][LaTeX]]
   LaTeX是一个高质量的排版系统。它是为科学和技术文档来设计的。它是通讯
   和科学领域的事实标准。关键是，它还免费。我的简历是直接用它来排版的。

* Org Mode直接导出pdf
  Org Mode支持各种各样的导出。本文只介绍Org Mode直接导出pdf文档相关内
  容。

  简单来说，想要把Org Mode写的纯文本文件转为pdf文件进行发布，需要先导
  出为LaTeX的源文件，然后再通过LaTeX提供的工具来“编译”为pdf。
  #+BEGIN_SRC artist

+--------------------------+
| Org Mode Plain Text File |
+--------------------------+
           |
           | export
           v
+--------------------------+
|  LaTeX Source File       |
+--------------------------+
           |
           | compile
           v
+--------------------------+
|   Final pdf file         |
+--------------------------+
  #+END_SRC

** 配置texlive环境
   可以到 [[https://www.tug.org/texlive/acquire-dvd.html][这里]] 去下载新的最新的texlive的iso文件。

   下载完成后，使用下面命令把iso挂载到目录：
   #+BEGIN_SRC sh
sudo mount -o loop texlive.iso /tmp/texlive/
   #+END_SRC

   进入对应目录执行install开头的脚本即可。

   安装完成后，会有提示需要设置几个环境变量：
   #+BEGIN_EXAMPLE
Welcome to TeX Live!

See /usr/local/texlive/2018/index.html for links to documentation.
The TeX Live web site (http://tug.org/texlive/) contains any updates and
corrections. TeX Live is a joint project of the TeX user groups around the
world; please consider supporting it by joining the group best for you. The
list of groups is available on the web at http://tug.org/usergroups.html.

Add /usr/local/texlive/2018/texmf-dist/doc/man to MANPATH.
Add /usr/local/texlive/2018/texmf-dist/doc/info to INFOPATH.
Most importantly, add /usr/local/texlive/2018/bin/x86_64-linux
to your PATH for current and future sessions.
   #+END_EXAMPLE

   在.bashrc这些地方搞定就可以了， *注意* ，这几个变量是必须要设置的，
   不然可能编译都通不过。
   #+BEGIN_SRC sh
# for texlive
export PATH=/usr/local/texlive/2018/bin/x86_64-linux:$PATH
export MANPATH=/usr/local/texlive/2018/texmf-dist/doc/man:$MANPATH
export INFOPATH=/usr/local/texlive/2018/texmf-dist/doc/info:$INFOPATH
   #+END_SRC

   然后就可以使用 =xelatex= 来把tex的源文件编译为pdf文件啦。

*** 字体
    以前texlive默认选择的是windows上的字体。在linux上我有时直接把
    windows上的字体拷过来当成盗版来用。有时是去配置texlive使用当前系统
    有的字体。

    新款的texlive（我当前使用的是2018）是支持ubuntu和mac了。看起来，直
    接使用 !fontsec=ubuntu! 选项就可以了。比如这样：
    #+BEGIN_EXAMPLE
\documentclass[11pt,fontset=ubuntu]{ctexart}
    #+END_EXAMPLE
    这个选项其实就是在选择
    =/usr/local/texlive/2018/texmf-dist/tex/latex/ctex/fontset/= 目录中
    的哪个文件。我看里面的代码，其实它就是设置中文字体为文泉一系的字体
    了。

    如果ubuntu上没有安装文泉字体，编译还是会报错。这时候不如就手动设置
    中文字体，可以参考下面的latex代码：
    #+ATTR_LATEX: :environment verbatim
    #+BEGIN_EXAMPLE
\documentclass{article}

\usepackage{xeCJK}

% 下面这些字体一定要是系统有的
\setCJKmainfont[BoldFont={SimHei},ItalicFont={STKaiti}]{SimSun}
\setCJKsansfont{SimHei}
\setCJKmonofont{STFangsong}
\setCJKfamilyfont{zhsong}{SimSun}
\setCJKfamilyfont{zhhei}{SimHei}
\setCJKfamilyfont{zhkai}{STKaiti}
\setCJKfamilyfont{zhfs}{STFangsong}

% 重新定义一些中文拼音命令方便使用
\newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体
\newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体
\newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书
\newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋
\newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书
\newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆

\begin{document}

你好，TeX Live 2009！

\lishu{这是隶书}

\fangsong{这是仿宋}

\songti{这是宋体}

\heiti{这是黑体}

\kaishu{这是楷书}

\youyuan{这是幼圆}

\end{document}
    #+END_EXAMPLE

** 查询latex的package
   可以使用 =texdoc= 命令来查询。
   #+BEGIN_SRC sh
texdoc spverbatim
   #+END_SRC
** 自定义生成pdf的格式
