archive/before-2018-11-10/2018-05-30-org-mode-to-pdf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-20 Sat 10:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-mode写文档</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">org-mode写文档</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7a8d115">1. 介绍</a>
<ul>
<li><a href="#org15954ea">1.1. Org Mode</a></li>
<li><a href="#orgf032356">1.2. LaTeX</a></li>
</ul>
</li>
<li><a href="#org87d733a">2. Org Mode直接导出pdf</a>
<ul>
<li><a href="#org0812fdd">2.1. 配置texlive环境</a>
<ul>
<li><a href="#orga6a7a0f">2.1.1. 字体</a></li>
</ul>
</li>
<li><a href="#org3528905">2.2. 查询latex的package</a></li>
<li><a href="#orgfb2316e">2.3. 自定义生成pdf的格式</a>
<ul>
<li><a href="#orgde3f111">2.3.1. org文档转pdf文件格式</a></li>
<li><a href="#orge9548f6">2.3.2. 结合body only进一步定制pdf文件格式</a>
<ul>
<li><a href="#org6f51f71">2.3.2.1. 需要修改文章头页眉页脚等</a></li>
<li><a href="#org4510e1a">2.3.2.2. 需要在文档中直接插入latex源码</a></li>
</ul>
</li>
<li><a href="#org7869ddb">2.3.3. org文档中需要写latex源码做为示例</a></li>
<li><a href="#orge7e1d2d">2.3.4. org的block中的行太长</a></li>
<li><a href="#org9a2e361">2.3.5. 标题和目录分页显示</a></li>
<li><a href="#org0f912d3">2.3.6. 自定义源码的格式</a></li>
<li><a href="#orged6d2e2">2.3.7. 全局定义example block导出的environment</a></li>
<li><a href="#org33f0b35">2.3.8. org导出标题的级别</a></li>
<li><a href="#org29b2de1">2.3.9. 不要title页</a></li>
<li><a href="#org19fb0d3">2.3.10. <span class="todo TODO">TODO</span> mylongverbatim现在使用的是listings，换行后不爽，看下能不能使用 <code>spverbatim</code> 。后者我加不上frame加框</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdaa7d59">3. Org Mode导出为html再打印成pdf</a>
<ul>
<li><a href="#orgd769848">3.1. 最简单的做法</a></li>
<li><a href="#orgd00a671">3.2. 为pdf加书签(bookmarks)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7a8d115" class="outline-2">
<h2 id="org7a8d115"><span class="section-number-2">1</span> 介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
I really do not like Microsoft Word！
</p>
</div>

<div id="outline-container-org15954ea" class="outline-3">
<h3 id="org15954ea"><span class="section-number-3">1.1</span> <a href="https://orgmode.org/">Org Mode</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
一个快速高效的纯文本系统。我所有笔记，TODO，当前的blog以及研究生毕业
论文全都是用它写的。
</p>

<p>
优点：
</p>
<ol class="org-ol">
<li>纯文本。</li>
<li>开源。</li>
<li>高效。</li>
</ol>
</div>
</div>

<div id="outline-container-orgf032356" class="outline-3">
<h3 id="orgf032356"><span class="section-number-3">1.2</span> <a href="https://www.latex-project.org/">LaTeX</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
LaTeX是一个高质量的排版系统。它是为科学和技术文档来设计的。它是通讯
和科学领域的事实标准。关键是，它还免费。我的简历是直接用它来排版的。
</p>
</div>
</div>
</div>

<div id="outline-container-org87d733a" class="outline-2">
<h2 id="org87d733a"><span class="section-number-2">2</span> Org Mode直接导出pdf</h2>
<div class="outline-text-2" id="text-2">
<p>
Org Mode支持各种各样的导出。本文只介绍Org Mode直接导出pdf文档相关内
容。
</p>

<p>
简单来说，想要把Org Mode写的纯文本文件转为pdf文件进行发布，需要先导
出为LaTeX的源文件，然后再通过LaTeX提供的工具来“编译”为pdf。
</p>
<div class="org-src-container">
<pre class="src src-artist">
+--------------------------+
| Org Mode Plain Text File |
+--------------------------+
           |
           | export
           v
+--------------------------+
|  LaTeX Source File       |
+--------------------------+
           |
           | compile
           v
+--------------------------+
|   Final pdf file         |
+--------------------------+
</pre>
</div>
</div>

<div id="outline-container-org0812fdd" class="outline-3">
<h3 id="org0812fdd"><span class="section-number-3">2.1</span> 配置texlive环境</h3>
<div class="outline-text-3" id="text-2-1">
<p>
可以到 <a href="https://www.tug.org/texlive/acquire-dvd.html">这里</a> 去下载新的最新的texlive的iso文件。
</p>

<p>
下载完成后，使用下面命令把iso挂载到目录：
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo mount -o loop texlive.iso /tmp/texlive/
</pre>
</div>

<p>
进入对应目录执行install开头的脚本即可。
</p>

<p>
安装完成后，会有提示需要设置几个环境变量：
</p>
<pre class="example">
Welcome to TeX Live!

See /usr/local/texlive/2018/index.html for links to documentation.
The TeX Live web site (http://tug.org/texlive/) contains any updates and
corrections. TeX Live is a joint project of the TeX user groups around the
world; please consider supporting it by joining the group best for you. The
list of groups is available on the web at http://tug.org/usergroups.html.

Add /usr/local/texlive/2018/texmf-dist/doc/man to MANPATH.
Add /usr/local/texlive/2018/texmf-dist/doc/info to INFOPATH.
Most importantly, add /usr/local/texlive/2018/bin/x86_64-linux
to your PATH for current and future sessions.
</pre>

<p>
在.bashrc这些地方搞定就可以了， <b>注意</b> ，这几个变量是必须要设置的，
不然可能编译都通不过。
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">for texlive</span>
<span style="color: #d18aff;">export</span> <span style="color: #ff8700;">PATH</span>=/usr/local/texlive/2018/bin/x86_64-linux:$<span style="color: #ff8700;">PATH</span>
<span style="color: #d18aff;">export</span> <span style="color: #ff8700;">MANPATH</span>=/usr/local/texlive/2018/texmf-dist/doc/man:$<span style="color: #ff8700;">MANPATH</span>
<span style="color: #d18aff;">export</span> <span style="color: #ff8700;">INFOPATH</span>=/usr/local/texlive/2018/texmf-dist/doc/info:$<span style="color: #ff8700;">INFOPATH</span>
</pre>
</div>

<p>
然后就可以使用 <code>xelatex</code> 来把tex的源文件编译为pdf文件啦。
</p>
</div>

<div id="outline-container-orga6a7a0f" class="outline-4">
<h4 id="orga6a7a0f"><span class="section-number-4">2.1.1</span> 字体</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
以前texlive默认选择的是windows上的字体。在linux上我有时直接把
windows上的字体拷过来当成盗版来用。有时是去配置texlive使用当前系统
有的字体。
</p>

<p>
新款的texlive（我当前使用的是2018）是支持ubuntu和mac了。看起来，直
接使用 !fontsec=ubuntu! 选项就可以了。比如这样：
</p>
<pre class="example">
\documentclass[11pt,fontset=ubuntu]{ctexart}
</pre>
<p>
这个选项其实就是在选择
<code>/usr/local/texlive/2018/texmf-dist/tex/latex/ctex/fontset/</code> 目录中
的哪个文件。我看里面的代码，其实它就是设置中文字体为文泉一系的字体
了。
</p>

<p>
如果ubuntu上没有安装文泉字体，编译还是会报错。这时候不如就手动设置
中文字体，可以参考下面的latex代码：
</p>
<pre class="example">
\documentclass{article}

\usepackage{xeCJK}

% 下面这些字体一定要是系统有的
\setCJKmainfont[BoldFont={SimHei},ItalicFont={STKaiti}]{SimSun}
\setCJKsansfont{SimHei}
\setCJKmonofont{STFangsong}
\setCJKfamilyfont{zhsong}{SimSun}
\setCJKfamilyfont{zhhei}{SimHei}
\setCJKfamilyfont{zhkai}{STKaiti}
\setCJKfamilyfont{zhfs}{STFangsong}

% 重新定义一些中文拼音命令方便使用
\newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体
\newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体
\newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书
\newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋
\newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书
\newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆

\begin{document}

你好，TeX Live 2009！

\lishu{这是隶书}

\fangsong{这是仿宋}

\songti{这是宋体}

\heiti{这是黑体}

\kaishu{这是楷书}

\youyuan{这是幼圆}

\end{document}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3528905" class="outline-3">
<h3 id="org3528905"><span class="section-number-3">2.2</span> 查询latex的package</h3>
<div class="outline-text-3" id="text-2-2">
<p>
可以使用 <code>texdoc</code> 命令来查询。
</p>
<div class="org-src-container">
<pre class="src src-sh">texdoc spverbatim
</pre>
</div>
</div>
</div>
