archive/before-2018-11-10/source/2018-05-30-org-mode-to-pdf.org
*** org文档转pdf文件格式
    原生的org生成的tex源文件都是使用 =article= 这个class。作为中文用户，
    需要设置org在导出的时候使用 =ctexart= ，还可以根据自己需要定制一下。
    设轩 =org-latex-classes= 这个变量就可以了。
    #+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes '("ctexart" "\\documentclass[11pt]{ctexart}
[NO-DEFAULT-PACKAGES]
\\usepackage[utf8]{inputenc}
\\usepackage[T1]{fontenc}
\\usepackage{fixltx2e}
\\usepackage{graphicx}
\\usepackage{longtable}
\\usepackage{float}
\\usepackage{wrapfig}
\\usepackage{rotating}
\\usepackage[normalem]{ulem}
\\usepackage{amsmath}
\\usepackage{textcomp}
\\usepackage{marvosym}
\\usepackage{wasysym}
\\usepackage{listings}
\\usepackage{amssymb}
\\usepackage{booktabs}
\\usepackage[colorlinks,linkcolor=black,anchorcolor=red,citecolor=black]{hyperref}
\\tolerance=1000

% 设置源码格式
\\lstset{framexleftmargin=5mm, frame=shadowbox, rulesepcolor=\\color{blue}}
\\lstset{basicstyle=\\tiny}
\\lstset{postbreak=\\space, breakindent=5pt, breaklines}

% 设置verbatim的字体大小
\\makeatletter
\\def\\verbatim{\\tiny\\@verbatim \\frenchspacing\\@vobeyspaces \\@xverbatim}
\\makeatother
"
                                  ("\\section{%s}" . "\\section*{%s}")
                                  ("\\subsection{%s}" . "\\subsection*{%s}")
                                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                                  ("\\paragraph{%s}" . "\\paragraph*{%s}")
                                  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

;;; 设置默认的class为ctexart
(setq org-latex-default-class "ctexart")
    #+END_SRC

    设置好后，所有通过org文件导出的tex源文件的开头部分就是我们设置的内
    容了。

    这样就可以从org文件直接导出到pdf文件。后面如果需要修改导出的pdf的默
    认章节格式时，可以直接修改一下上面的变量即可。

    还可以设置多个class，然后在单个org文件中指定使用：
    #+BEGIN_SRC org
,#+LATEX_CLASS: article
    #+END_SRC
    这样设置后，该文件导出还是按 =article= 的设置来。
*** 结合body only进一步定制pdf文件格式
    有时针对一个类型的文档，可能需要进一步的定制，可能到了需要修改latex
    源码的时候，有两种办法。

**** 需要修改文章头页眉页脚等
     org在导出时，有一个 =body-only= 的选项，打开后（在 =C-c C-e= 后默
     认是使用 =C-b= 来切换），只有内容才会导出。

     有了这个功能，可以把tex源文件的头部分开，需要修改格式的tex源码都在
     这个文件进行，然后 =\include{body}= 就可以了。

     假设org文件名为 =body.org= ，我开启 =body-only= 后，导出到
     =body.tex= 文件中。

     写一个 =head.tex= 大概像这样：
     #+ATTR_LATEX: :environment verbatim
     #+BEGIN_EXAMPLE
\documentclass[11pt]{ctexart}

%% 这里面可以随意地修改格式

\maketitle

\clearpage

\tableofcontents

%% 这个直接把内容包进来就好
\include{body}

\end{document}
     #+END_EXAMPLE

     最后直接编译 =head.tex= 就可以了。

**** 需要在文档中直接插入latex源码
     直接使用 =+BEGIN_LATEX= 这个的block插入就可以了。

*** org文档中需要写latex源码做为示例
    此时直接使用 =example= 的block还不行，需要给这个block加上一个latex
    的属性。比如这样：
    #+BEGIN_SRC org
,#+ATTR_LATEX: :environment verbatim
,#+BEGIN_EXAMPLE
\documentclass{article}

hi

\end{document}
,#+END_EXAMPLE
    #+END_SRC
    这样导出的tex文件会被一个 =verbatim= 包住。

*** org的block中的行太长
    默认的block导出来对应的tex都是 =verbatim= 。verbatim对太长的行不会
    自动折行。这样如果我写了很长的行在block里面。导出的pdf就超长了。

    解决的方法有几种：
    1. 不要在block中写太长的行。废话。

    2. 设置默认verbatim的字体，缩小它的字体。这种方法可以解决一些情况。
       但还是治标不治本。我在导出的tex前后加入了下面这段：
       #+ATTR_LATEX: :environment verbatim
       #+BEGIN_EXAMPLE
% 设置verbatim的字体大小
\\makeatletter
\\def\\verbatim{\\tiny\\@verbatim \\frenchspacing\\@vobeyspaces \\@xverbatim}
\\makeatother
       #+END_EXAMPLE
       这样verbatim都是使用tiny的字体了。

    3. 使用 =spverbatim= 包。这个包可以自动给超长的行添加换行。在头部
       加上 =\usepackge{spverbatim}= 后。 *注意* ，我测试出来的话，当
       前只在org的example这个block支持 =:environment= 这个选项。直接接
       照这样写就可以了：
       #+BEGIN_SRC org
,#+ATTR_LATEX: :environment spverbatim
,#+BEGIN_EXAMPLE
This is a very long line.
,#+END_EXAMPLE
       #+END_SRC
       这样这个block导出就会被 =spverbatim= 包住，而不是默认的
       =verbatim= 了。

*** 标题和目录分页显示
    在org文件中加入这样神奇的一行就可以了：
    #+BEGIN_SRC org
,#+LATEX_HEADER: \makeatletter \def\@maketitle{\null \begin{center} {\vskip 5em \Huge \@title} \vskip 30em {\LARGE \@author} \vskip 3em {\LARGE \@date} \end{center} \newpage} \makeatother
    #+END_SRC

    这个我参考的是 [[https://emacs-china.org/t/org-mode-pdf/245/5][这里]] 。
    #+BEGIN_EXAMPLE
要在org-mode导出时让标题页和目录页分页显示，得修改\maketitle命令，查阅
有两种方法，一种直接修改，见链接
http://tex.stackexchange.com/questions/216098/redefine-maketitle 6 ，
另一种是用titling包去修改，我自己在org-mode加入一下代码，标题页和目录
页就可以分开了，具体样式可以自己去修改
    #+END_EXAMPLE

