archive/before-2018-11-10/2018-05-30-org-mode-to-pdf.html
<div id="outline-container-orgfb2316e" class="outline-3">
<h3 id="orgfb2316e"><span class="section-number-3">2.3</span> 自定义生成pdf的格式</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgde3f111" class="outline-4">
<h4 id="orgde3f111"><span class="section-number-4">2.3.1</span> org文档转pdf文件格式</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
原生的org生成的tex源文件都是使用 <code>article</code> 这个class。作为中文用户，
需要设置org在导出的时候使用 <code>ctexart</code> ，还可以根据自己需要定制一下。
设轩 <code>org-latex-classes</code> 这个变量就可以了。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'org-latex-classes '(<span style="color: #ff4ea3;">"ctexart"</span> <span style="color: #ff4ea3;">"\\documentclass[11pt]{ctexart}</span>
<span style="color: #ff4ea3;">[NO-DEFAULT-PACKAGES]</span>
<span style="color: #ff4ea3;">\\usepackage[utf8]{inputenc}</span>
<span style="color: #ff4ea3;">\\usepackage[T1]{fontenc}</span>
<span style="color: #ff4ea3;">\\usepackage{fixltx2e}</span>
<span style="color: #ff4ea3;">\\usepackage{graphicx}</span>
<span style="color: #ff4ea3;">\\usepackage{longtable}</span>
<span style="color: #ff4ea3;">\\usepackage{float}</span>
<span style="color: #ff4ea3;">\\usepackage{wrapfig}</span>
<span style="color: #ff4ea3;">\\usepackage{rotating}</span>
<span style="color: #ff4ea3;">\\usepackage[normalem]{ulem}</span>
<span style="color: #ff4ea3;">\\usepackage{amsmath}</span>
<span style="color: #ff4ea3;">\\usepackage{textcomp}</span>
<span style="color: #ff4ea3;">\\usepackage{marvosym}</span>
<span style="color: #ff4ea3;">\\usepackage{wasysym}</span>
<span style="color: #ff4ea3;">\\usepackage{listings}</span>
<span style="color: #ff4ea3;">\\usepackage{amssymb}</span>
<span style="color: #ff4ea3;">\\usepackage{booktabs}</span>
<span style="color: #ff4ea3;">\\usepackage[colorlinks,linkcolor=black,anchorcolor=red,citecolor=black]{hyperref}</span>
<span style="color: #ff4ea3;">\\tolerance=1000</span>

<span style="color: #ff4ea3;">% &#35774;&#32622;&#28304;&#30721;&#26684;&#24335;</span>
<span style="color: #ff4ea3;">\\lstset{framexleftmargin=5mm, frame=shadowbox, rulesepcolor=\\color{blue}}</span>
<span style="color: #ff4ea3;">\\lstset{basicstyle=\\tiny}</span>
<span style="color: #ff4ea3;">\\lstset{postbreak=\\space, breakindent=5pt, breaklines}</span>

<span style="color: #ff4ea3;">% &#35774;&#32622;verbatim&#30340;&#23383;&#20307;&#22823;&#23567;</span>
<span style="color: #ff4ea3;">\\makeatletter</span>
<span style="color: #ff4ea3;">\\def\\verbatim{\\tiny\\@verbatim \\frenchspacing\\@vobeyspaces \\@xverbatim}</span>
<span style="color: #ff4ea3;">\\makeatother</span>
<span style="color: #ff4ea3;">"</span>
                                  (<span style="color: #ff4ea3;">"\\section{%s}"</span> . <span style="color: #ff4ea3;">"\\section*{%s}"</span>)
                                  (<span style="color: #ff4ea3;">"\\subsection{%s}"</span> . <span style="color: #ff4ea3;">"\\subsection*{%s}"</span>)
                                  (<span style="color: #ff4ea3;">"\\subsubsection{%s}"</span> . <span style="color: #ff4ea3;">"\\subsubsection*{%s}"</span>)
                                  (<span style="color: #ff4ea3;">"\\paragraph{%s}"</span> . <span style="color: #ff4ea3;">"\\paragraph*{%s}"</span>)
                                  (<span style="color: #ff4ea3;">"\\subparagraph{%s}"</span> . <span style="color: #ff4ea3;">"\\subparagraph*{%s}"</span>)))

<span style="color: #6c6c6c; font-style: italic;">;;; </span><span style="color: #6c6c6c; font-style: italic;">&#35774;&#32622;&#40664;&#35748;&#30340;class&#20026;ctexart</span>
(<span style="color: #a1db00;">setq</span> org-latex-default-class <span style="color: #ff4ea3;">"ctexart"</span>)
</pre>
</div>

<p>
设置好后，所有通过org文件导出的tex源文件的开头部分就是我们设置的内
容了。
</p>

<p>
这样就可以从org文件直接导出到pdf文件。后面如果需要修改导出的pdf的默
认章节格式时，可以直接修改一下上面的变量即可。
</p>

<p>
还可以设置多个class，然后在单个org文件中指定使用：
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #6c6c6c; font-style: italic;">#+LATEX_CLASS: article</span>
</pre>
</div>
<p>
这样设置后，该文件导出还是按 <code>article</code> 的设置来。
</p>
</div>
</div>
<div id="outline-container-orge9548f6" class="outline-4">
<h4 id="orge9548f6"><span class="section-number-4">2.3.2</span> 结合body only进一步定制pdf文件格式</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
有时针对一个类型的文档，可能需要进一步的定制，可能到了需要修改latex
源码的时候，有两种办法。
</p>
</div>

<div id="outline-container-org6f51f71" class="outline-5">
<h5 id="org6f51f71"><span class="section-number-5">2.3.2.1</span> 需要修改文章头页眉页脚等</h5>
<div class="outline-text-5" id="text-2-3-2-1">
<p>
org在导出时，有一个 <code>body-only</code> 的选项，打开后（在 <code>C-c C-e</code> 后默
认是使用 <code>C-b</code> 来切换），只有内容才会导出。
</p>

<p>
有了这个功能，可以把tex源文件的头部分开，需要修改格式的tex源码都在
这个文件进行，然后 <code>\include{body}</code> 就可以了。
</p>

<p>
假设org文件名为 <code>body.org</code> ，我开启 <code>body-only</code> 后，导出到
<code>body.tex</code> 文件中。
</p>

<p>
写一个 <code>head.tex</code> 大概像这样：
</p>
<pre class="example">
\documentclass[11pt]{ctexart}

%% 这里面可以随意地修改格式

\maketitle

\clearpage

\tableofcontents

%% 这个直接把内容包进来就好
\include{body}

\end{document}
</pre>

<p>
最后直接编译 <code>head.tex</code> 就可以了。
</p>
</div>
</div>

<div id="outline-container-org4510e1a" class="outline-5">
<h5 id="org4510e1a"><span class="section-number-5">2.3.2.2</span> 需要在文档中直接插入latex源码</h5>
<div class="outline-text-5" id="text-2-3-2-2">
<p>
直接使用 <code>+BEGIN_LATEX</code> 这个的block插入就可以了。
</p>
</div>
</div>
</div>

<div id="outline-container-org7869ddb" class="outline-4">
<h4 id="org7869ddb"><span class="section-number-4">2.3.3</span> org文档中需要写latex源码做为示例</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
此时直接使用 <code>example</code> 的block还不行，需要给这个block加上一个latex
的属性。比如这样：
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #6c6c6c; font-style: italic;">#+ATTR_LATEX: :environment verbatim</span>
<span style="color: #eeeeee; background-color: #005f87;">#+BEGIN_EXAMPLE</span>
\documentclass{article}

hi

\end{document}
<span style="color: #4e4e4e; background-color: #3a3a3a;">#+END_EXAMPLE</span>
</pre>
</div>
<p>
这样导出的tex文件会被一个 <code>verbatim</code> 包住。
</p>
</div>
</div>

<div id="outline-container-orge7e1d2d" class="outline-4">
<h4 id="orge7e1d2d"><span class="section-number-4">2.3.4</span> org的block中的行太长</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
默认的block导出来对应的tex都是 <code>verbatim</code> 。verbatim对太长的行不会
自动折行。这样如果我写了很长的行在block里面。导出的pdf就超长了。
</p>

<p>
解决的方法有几种：
</p>
<ol class="org-ol">
<li>不要在block中写太长的行。废话。</li>

<li><p>
设置默认verbatim的字体，缩小它的字体。这种方法可以解决一些情况。
但还是治标不治本。我在导出的tex前后加入了下面这段：
</p>
<pre class="example">
% 设置verbatim的字体大小
\\makeatletter
\\def\\verbatim{\\tiny\\@verbatim \\frenchspacing\\@vobeyspaces \\@xverbatim}
\\makeatother
</pre>
<p>
这样verbatim都是使用tiny的字体了。
</p></li>

<li><p>
使用 <code>spverbatim</code> 包。这个包可以自动给超长的行添加换行。在头部
加上 <code>\usepackge{spverbatim}</code> 后。 <b>注意</b> ，我测试出来的话，当
前只在org的example这个block支持 <code>:environment</code> 这个选项。直接接
照这样写就可以了：
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #6c6c6c; font-style: italic;">#+ATTR_LATEX: :environment spverbatim</span>
<span style="color: #eeeeee; background-color: #005f87;">#+BEGIN_EXAMPLE</span>
This is a very long line.
<span style="color: #4e4e4e; background-color: #3a3a3a;">#+END_EXAMPLE</span>
</pre>
</div>
<p>
这样这个block导出就会被 <code>spverbatim</code> 包住，而不是默认的
<code>verbatim</code> 了。
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org9a2e361" class="outline-4">
<h4 id="org9a2e361"><span class="section-number-4">2.3.5</span> 标题和目录分页显示</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
在org文件中加入这样神奇的一行就可以了：
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #6c6c6c; font-style: italic;">#+LATEX_HEADER: \makeatletter \def\@maketitle{\null \begin{center} {\vskip 5em \Huge \@title} \vskip 30em {\LARGE \@author} \vskip 3em {\LARGE \@date} \end{center} \newpage} \makeatother</span>
</pre>
</div>

<p>
这个我参考的是 <a href="https://emacs-china.org/t/org-mode-pdf/245/5">这里</a> 。
</p>
<pre class="example">
要在org-mode导出时让标题页和目录页分页显示，得修改\maketitle命令，查阅
有两种方法，一种直接修改，见链接
http://tex.stackexchange.com/questions/216098/redefine-maketitle 6 ，
另一种是用titling包去修改，我自己在org-mode加入一下代码，标题页和目录
页就可以分开了，具体样式可以自己去修改
</pre>
</div>
</div>
