archive/before-2018-11-10/source/2018-05-30-org-mode-to-pdf.org
*** 自定义源码的格式
    源码默认的block默认导出还是 =verbatim= 此时还管设置什么 =options=
    都是不支持的。可以修改为 =listings= 或者 =minted= 。

    这样修改就是listings了：
    #+BEGIN_SRC emacs-lisp
;; 设置org-mode的源代码block默认导出的latex的environment为listtings
(setq org-latex-listings 'listings)
(add-to-list 'org-latex-packages-alist '("" "listings"))
    #+END_SRC

    这样设置为 =minted= ：
    #+BEGIN_SRC emacs-lisp
;; 设置org-mode的源代码block默认导出的latex的environment为minted
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      )
    #+END_SRC

    这两个都是支持直接在org中设置options：
    #+BEGIN_SRC org
     ,#+ATTR_LATEX: :options commentstyle=\bfseries
     ,#+BEGIN_SRC emacs-lisp
       (defun Fib (n)
         (if (< n 2) n (+ (Fib (- n 1)) (Fib (- n 2)))))
     ,#+END_SRC
    #+END_SRC

    设置源代码导出为这两个环境后，需要给编译的命令加上 =-shell-escape=
    选项。
    比如我这样设置编译命令：
    #+BEGIN_SRC emacs-lisp
(setq org-latex-pdf-process
      '(
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "rm -fr %b.out %b.log %b.tex auto"
        ))
    #+END_SRC

*** 全局定义example block导出的environment
    参考info，可以给 =org-export-filter-TYPE-block-functions= 挂钩子。
    会把所有block的text都传给它。这里我直接在钩子函数里面把
    ={verbatim}= 替换成了 =mylongverbatim= 。当然， =mylongverbatim=
    是我自定义好的。
    #+BEGIN_SRC emacs-lisp
;; 添加这个filter把默认example导出的environment从verbatim换成我自定
;; 议的 mylongverbatim
(defun my-latex-filter-example-myverbatim (text backend info)
  "user my customized verbatim."
  (when (org-export-derived-backend-p backend 'latex)
    (replace-regexp-in-string "{verbatim}" "{mylongverbatim}" text)))
(add-to-list 'org-export-filter-example-block-functions
             'my-latex-filter-example-myverbatim)
    #+END_SRC
*** org导出标题的级别
    默认是3级，可以修改变量 =org-export-headline-levels= 。

    也可以直接在org文件中设置，这样就可以设置为4级：
    #+BEGIN_SRC org
,#+options: H:4
    #+END_SRC
*** 不要title页
    下面这样就可以搞定：
    #+BEGIN_SRC org
,#+title:
,#+OPTIONS: author:nil date:nil
    #+END_SRC
*** TODO mylongverbatim现在使用的是listings，换行后不爽，看下能不能使用 =spverbatim= 。后者我加不上frame加框
* Org Mode导出为html再打印成pdf
** 最简单的做法
   org-mode转html是最简单的。html可以直接打印为pdf。在chrome中，一般可
   以设置不需要打印页眉页脚。

   如果有很长的行，还可以通过在打印时缩放来缩小后打印。

