archive/before-2018-11-10/2018-05-30-org-mode-to-pdf.html

<div id="outline-container-org0f912d3" class="outline-4">
<h4 id="org0f912d3"><span class="section-number-4">2.3.6</span> 自定义源码的格式</h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
源码默认的block默认导出还是 <code>verbatim</code> 此时还管设置什么 <code>options</code>
都是不支持的。可以修改为 <code>listings</code> 或者 <code>minted</code> 。
</p>

<p>
这样修改就是listings了：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">&#35774;&#32622;org-mode&#30340;&#28304;&#20195;&#30721;block&#40664;&#35748;&#23548;&#20986;&#30340;latex&#30340;environment&#20026;listtings</span>
(<span style="color: #a1db00;">setq</span> org-latex-listings 'listings)
(add-to-list 'org-latex-packages-alist '(<span style="color: #ff4ea3;">""</span> <span style="color: #ff4ea3;">"listings"</span>))
</pre>
</div>

<p>
这样设置为 <code>minted</code> ：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">&#35774;&#32622;org-mode&#30340;&#28304;&#20195;&#30721;block&#40664;&#35748;&#23548;&#20986;&#30340;latex&#30340;environment&#20026;minted</span>
(<span style="color: #a1db00;">setq</span> org-latex-listings 'minted
      org-latex-packages-alist '((<span style="color: #ff4ea3;">""</span> <span style="color: #ff4ea3;">"minted"</span>))
      )
</pre>
</div>

<p>
这两个都是支持直接在org中设置options：
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #6c6c6c; font-style: italic;">     #+ATTR_LATEX: :options commentstyle=\bfseries</span>
<span style="color: #eeeeee; background-color: #005f87;">     #+BEGIN_SRC emacs-lisp</span>
<span style="color: #5fafd7; background-color: #3a3a3a;">       (</span><span style="color: #a1db00; background-color: #3a3a3a;">defun</span><span style="color: #5fafd7; background-color: #3a3a3a;"> </span><span style="color: #ffd700; background-color: #3a3a3a;">Fib</span><span style="color: #5fafd7; background-color: #3a3a3a;"> (n)</span>
<span style="color: #5fafd7; background-color: #3a3a3a;">         (</span><span style="color: #a1db00; background-color: #3a3a3a;">if</span><span style="color: #5fafd7; background-color: #3a3a3a;"> (&lt; n 2) n (+ (Fib (- n 1)) (Fib (- n 2)))))</span>
<span style="color: #4e4e4e; background-color: #3a3a3a;">     #+END_SRC</span>
</pre>
</div>

<p>
设置源代码导出为这两个环境后，需要给编译的命令加上 <code>-shell-escape</code>
选项。
比如我这样设置编译命令：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">setq</span> org-latex-pdf-process
      '(
        <span style="color: #ff4ea3;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #ff4ea3;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #ff4ea3;">"xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #ff4ea3;">"rm -fr %b.out %b.log %b.tex auto"</span>
        ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orged6d2e2" class="outline-4">
<h4 id="orged6d2e2"><span class="section-number-4">2.3.7</span> 全局定义example block导出的environment</h4>
<div class="outline-text-4" id="text-2-3-7">
<p>
参考info，可以给 <code>org-export-filter-TYPE-block-functions</code> 挂钩子。
会把所有block的text都传给它。这里我直接在钩子函数里面把
<code>{verbatim}</code> 替换成了 <code>mylongverbatim</code> 。当然， <code>mylongverbatim</code>
是我自定义好的。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">&#28155;&#21152;&#36825;&#20010;filter&#25226;&#40664;&#35748;example&#23548;&#20986;&#30340;environment&#20174;verbatim&#25442;&#25104;&#25105;&#33258;&#23450;</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">&#35758;&#30340; mylongverbatim</span>
(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">my-latex-filter-example-myverbatim</span> (text backend info)
  <span style="color: #ff4b4b;">"user my customized verbatim."</span>
  (<span style="color: #a1db00;">when</span> (org-export-derived-backend-p backend 'latex)
    (replace-regexp-in-string <span style="color: #ff4ea3;">"{verbatim}"</span> <span style="color: #ff4ea3;">"{mylongverbatim}"</span> text)))
(add-to-list 'org-export-filter-example-block-functions
             'my-latex-filter-example-myverbatim)
</pre>
</div>
</div>
</div>
<div id="outline-container-org33f0b35" class="outline-4">
<h4 id="org33f0b35"><span class="section-number-4">2.3.8</span> org导出标题的级别</h4>
<div class="outline-text-4" id="text-2-3-8">
<p>
默认是3级，可以修改变量 <code>org-export-headline-levels</code> 。
</p>

<p>
也可以直接在org文件中设置，这样就可以设置为4级：
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #6c6c6c; font-style: italic;">#+options: H:4</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org29b2de1" class="outline-4">
<h4 id="org29b2de1"><span class="section-number-4">2.3.9</span> 不要title页</h4>
<div class="outline-text-4" id="text-2-3-9">
<p>
下面这样就可以搞定：
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #ffaf5f; background-color: #6c6c6c;">#+title:</span>
<span style="color: #6c6c6c; font-style: italic;">#+OPTIONS: author:nil date:nil</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org19fb0d3" class="outline-4">
<h4 id="org19fb0d3"><span class="section-number-4">2.3.10</span> <span class="todo TODO">TODO</span> mylongverbatim现在使用的是listings，换行后不爽，看下能不能使用 <code>spverbatim</code> 。后者我加不上frame加框</h4>
</div>
</div>
</div>
<div id="outline-container-orgdaa7d59" class="outline-2">
<h2 id="orgdaa7d59"><span class="section-number-2">3</span> Org Mode导出为html再打印成pdf</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd769848" class="outline-3">
<h3 id="orgd769848"><span class="section-number-3">3.1</span> 最简单的做法</h3>
<div class="outline-text-3" id="text-3-1">
<p>
org-mode转html是最简单的。html可以直接打印为pdf。在chrome中，一般可
以设置不需要打印页眉页脚。
</p>

<p>
如果有很长的行，还可以通过在打印时缩放来缩小后打印。
</p>
</div>
</div>
